Revit 2027 API
ParameterTypeId.ViewportAttrOrientationOnSheet Property
 "Rotation on Sheet"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportAttrOrientationOnSheet { get; }
Public Shared ReadOnly Property ViewportAttrOrientationOnSheet As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportAttrOrientationOnSheet {
	ForgeTypeId^ get ();
}
static member ViewportAttrOrientationOnSheet : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace